In [72]:
import pandas as pd
import numpy as np

In [21]:
df = pd.read_csv('data/psfa_apple.csv')

In [22]:
df

,Date,Open,High,Low,Close,Adj Close,Volume
0,2006-10-02,10.728572,10.838572,10.614285,10.694285,7.239566,178159800
1,2006-10-03,10.635715,10.707143,10.455714,10.582857,7.164135,197677200
2,2006-10-04,10.585714,10.780000,10.451428,10.768572,7.289855,207270700
3,2006-10-05,10.647142,10.880000,10.590000,10.690000,7.236666,170970800
4,2006-10-06,10.631429,10.720000,10.544286,10.602858,7.177672,116739700
...,...,...,...,...,...,...,...
2827,2017-12-22,174.679993,175.419998,174.500000,175.009995,174.299362,16349400
2828,2017-12-26,170.800003,171.470001,169.679993,170.570007,169.877396,33185500
2829,2017-12-27,170.100006,170.779999,169.710007,170.600006,169.907272,21498200
2830,2017-12-28,171.000000,171.850006,170.479996,171.080002,170.385315,16480200
2831,2017-12-29,170.520004,170.589996,169.220001,169.229996,168.542831,25999900

In [14]:
df = df.astype({'Date':'datetime64[ns]'})
df.dtypes

Date         datetime64[ns]
Open                float64
High                float64
Low                 float64
Close               float64
Adj Close           float64
Volume                int64
dtype: object

In [18]:
df[(df['Date'] >= '2017-01-03') & (df['Date'] <= '2017-01-04')]

,Date,Open,High,Low,Close,Adj Close,Volume
2581,2017-01-03,115.800003,116.330002,114.760002,116.150002,113.847588,28781900
2582,2017-01-04,115.849998,116.510002,115.750000,116.019997,113.720161,21118100

In [34]:
print(df['High'].agg(['count','min','max','mean']))

count    2832.000000
min        10.568571
max       177.199997
mean       68.933320
Name: High, dtype: float64

In [69]:
a = np.array([[1,2,3,4],[1,2,3,4]])

In [71]:
a.shape

(2, 4)

In [ ]:
 ['Hombre' '109' '187']
 ['Hombre' '73' '174']

In [14]:
from utils import *

In [16]:
p1 = Person('as','dq','as')

In [18]:
s = Student('as','dq','as','qwedsa')